The column base can't be moved above its top.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ColumnBaseAboveTopFailure { get; }
  Visual Basic
Public Shared ReadOnly Property ColumnBaseAboveTopFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ColumnBaseAboveTopFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ColumnFailures Class
  Autodesk.Revit.DB Namespace